
print('введите номер задания')
k = int(input())
while k <= 5 and k > 0:
    if k == 1:
        print('Дан номер дня – целое число от 1 до 31 и месяца — целое\
число в диапазоне 1–12 (1 — январь, 2 — февраль и т. д.). \
Вывести дату в виде текста (например, «пятое января»).')
        a = int(input('День = '))
        b = int(input('Месяц = '))
        a0 = a // 10
        a1 = a % 10
        if a0 == 1:
            if a1 == 0: print('десятое', end=' ')
            if a1 == 1: print('одиннадцатое', end=' ')
            if a1 == 2: print('двенадцатое', end=' ')
            if a1 == 3: print('тринадцатое', end=' ')
            if a1 == 4: print('четырнадцатое', end=' ')
            if a1 == 5: print('пятнадцатое', end=' ')
            if a1 == 6: print('шестнадцатое', end=' ')
            if a1 == 7: print('семнадцатое', end=' ')
            if a1 == 8: print('восемнадцатое', end=' ')
            if a1 == 9: print('девятнадцатое', end=' ')
        else:
            if a0 == 2 and a1 == 0: print('двадцатое', end=' ')
            if a0 == 2 and a1 != 0: print('двадцать', end=' ')
            if a0 == 3 and a1 == 0: print('тридцатое', end=' ')
            if a0 == 3 and a1 != 0: print('тридцать', end=' ')
            if a1 == 1: print('первое', end=' ')
            if a1 == 2: print('второе', end=' ')
            if a1 == 3: print('третье', end=' ')
            if a1 == 4: print('четвертое', end=' ')
            if a1 == 5: print('пятое', end=' ')
            if a1 == 6: print('шестое', end=' ')
            if a1 == 7: print('седьмое', end=' ')
            if a1 == 8: print('восьмое', end=' ')
            if a1 == 9: print('девятое', end=' ')
        if b == 1: print('января')
        if b == 2: print('февраля')
        if b == 3: print('марта')
        if b == 4: print('апреля')
        if b == 5: print('мая')
        if b == 6: print('июня')
        if b == 7: print('июля')
        if b == 8: print('августа')
        if b == 9: print('сентября')
        if b == 10: print('октября')
        if b == 11: print('ноября')
        if b == 12: print('декабря')
        print('введите номер задания')
        k = int(input())
    if k == 2:
        print('Робот может перемещаться в четырех направлениях \
(«С» — север, «З» — запад, «Ю» — юг, «В» — восток) и принимать три цифровые команды:\
0 — продолжать движение, 1 — поворот налево, −1 — поворот направо.\
Вывести направление робота после выполнения полученной команды')
        c = input('Направление робота: ')
        n = int(input('команда:'))
        if c == 'Ю':
            if n == 0:
                print('Юг')
            if n == 1:
                print('Восток')
            if n == -1:
                print('Запад')
        if c == 'З':
            if n == 0:
                print('Запад')
            if n == 1:
                print('Юг')
            if n == -1:
                print('Север')
        if c == 'В':
            if n == 0:
                print('Восток')
            if n == 1:
                print('Север')
            if n == -1:
                print('Юг')
        if c == 'С':
            if n == 0:
                print('Север')
            if n == 1:
                print('Запад')
            if n == -1:
                print('Восток')
        print('введите номер задания')
        k = int(input())

    if k == 3:
        print('Дано целое число в диапазоне 10–40, определяющее количество\
учебных заданий по некоторой теме. Вывести строку-описание указанного количества заданий')
        a = int(input('Количество учебных заданий = '))
        a0 = a // 10
        a1 = a % 10
        if a0 == 1:
            if a1 == 0: print('десять', end=' ')
            if a1 == 1: print('одиннадцать', end=' ')
            if a1 == 2: print('двенадцать', end=' ')
            if a1 == 3: print('тринадцать', end=' ')
            if a1 == 4: print('четырнадцать', end=' ')
            if a1 == 5: print('пятнадцать', end=' ')
            if a1 == 6: print('шестнадцать', end=' ')
            if a1 == 7: print('семнадцать', end=' ')
            if a1 == 8: print('восемнадцать', end=' ')
            if a1 == 9: print('девятнадцать', end=' ')
        else:
            if a0 == 2: print('двадцать', end=' ')
            if a0 == 3: print('тридцать', end=' ')
            if a0 == 4: print('сорок', end=' ')
            if a1 == 1: print('одно', end=' ')
            if a1 == 2: print('два', end=' ')
            if a1 == 3: print('три', end=' ')
            if a1 == 4: print('четыре', end=' ')
            if a1 == 5: print('пять', end=' ')
            if a1 == 6: print('шесть', end=' ')
            if a1 == 7: print('семь', end=' ')
            if a1 == 8: print('восемь', end=' ')
            if a1 == 9: print('девять', end=' ')
        print('учебных заданий')
        print('введите номер задания')
        k = int(input())

    if k == 4:
        print('Дано целое число в диапазоне 100–999. Вывести строку-описание данного числа')
        a = int(input())
        a0 = a // 100
        a1 = a // 10 % 10
        a2 = a % 10
        if a0 == 1: print('сто', end=' ')
        if a0 == 2: print('двести', end=' ')
        if a0 == 3: print('триста', end=' ')
        if a0 == 4: print('четыреста', end=' ')
        if a0 == 5: print('пятьсот', end=' ')
        if a0 == 6: print('шестьсот', end=' ')
        if a0 == 7: print('семьсот', end=' ')
        if a0 == 8: print('восемьсот', end=' ')
        if a0 == 9: print('девятьсот', end=' ')
        if a1 == 1:
            if a2 == 0: print('десять', end=' ')
            if a2 == 1: print('одиннадцать', end=' ')
            if a2 == 2: print('двенадцать', end=' ')
            if a2 == 3: print('тринадцать', end=' ')
            if a2 == 4: print('четырнадцать', end=' ')
            if a2 == 5: print('пятнадцать', end=' ')
            if a2 == 6: print('шестнадцать', end=' ')
            if a2 == 7: print('семнадцать', end=' ')
            if a2 == 8: print('восемнадцать', end=' ')
            if a2 == 9: print('девятнадцать', end=' ')
        else:
            if a1 == 2: print('двадцать', end=' ')
            if a1 == 3: print('тридцать', end=' ')
            if a1 == 4: print('сорок', end=' ')
            if a1 == 5: print('пятьдесят', end=' ')
            if a1 == 6: print('шестьдесят', end=' ')
            if a1 == 7: print('семьдесят', end=' ')
            if a1 == 8: print('восемьдесят', end=' ')
            if a1 == 9: print('девяносто', end=' ')
            if a2 == 1: print('один', end=' ')
            if a2 == 2: print('два', end=' ')
            if a2 == 3: print('три', end=' ')
            if a2 == 4: print('четыре', end=' ')
            if a2 == 5: print('пять', end=' ')
            if a2 == 6: print('шесть', end=' ')
            if a2 == 7: print('семь', end=' ')
            if a2 == 8: print('восемь', end=' ')
            if a2 == 9: print('девять', end=' ')
        print('')
        print('введите номер задания')
        k = int(input())

    if k == 5:
        print('В восточном календаре принят 60-летний цикл, состоящий из 12- летних подциклов,\
обозначаемых названиями цвета: зеленый, красный, желтый, белый и черный.\
В каждом подцикле годы носят названия животных: крысы, коровы, тигра, зайца,\
дракона, змеи, лошади, овцы, обезьяны, курицы, собаки и свиньи.')
        a = int(input('Год: '))
        a1 = a % 10
        a2 = a % 12
        a3 = (a + 8) % 12
        print('год', end=' ')
        if a1 == 0 or a1 == 1: print('белый', end='')
        if a1 == 2 or a1 == 3: print('черный', end='')
        if a1 == 4 or a1 == 5: print('зеленый', end='')
        if a1 == 6 or a1 == 7: print('красный', end='')
        if a1 == 8 or a1 == 9: print('желтый', end='')
        if a2 == 6 or a2 == 7 or a2 == 8: print('', end=' ')
        else: print('', end=' ')
        if a3 == 0: print('крысы')
        if a3 == 1: print('коровы')
        if a3 == 2: print('тигра')
        if a3 == 3: print('зайца')
        if a3 == 4: print('дракона')
        if a3 == 5: print('змеи')
        if a3 == 6: print('лошади')
        if a3 == 7: print('овцы')
        if a3 == 8: print('обезьяны')
        if a3 == 9: print('курицы')
        if a3 == 10: print('собаки')
        if a3 == 11: print('свиньи')
        print('введите номер задания')
        k = int(input())
